Repository: oliverkroener/ok_prive_consent
Catalog: Resources/Private/Language/*.locallang.xlf
Languages: de

# mlang_labels_tablabel
source: Change settings for cookie consent
de: Einstellungen für Cookie-Zustimmung ändern

# mlang_labels_tabdescr
source: Here you manage the Prive scripts which are in charge of the Cookie consent banner of Prive
de: Hier verwalten Sie die Prive-Skripte, die für das Cookie-Zustimmungsbanner von Prive verantwortlich sind

# module.title
source: Prive Settings
de: Prive-Einstellungen

# module.description
source: Manage the JavaScript for cookie consent.
de: Verwalten Sie das JavaScript für die Cookie-Zustimmung.

# form.button.save
source: Save
de: Speichern

# flash.message.success
source: Script saved successfully.
de: Skript erfolgreich gespeichert.

# form.header.cookie_consent_script
source: Prive Settings
de: Prive-Einstellungen

# form.button.reset
source: Reset
de: Zurücksetzen

# form.header.error
source: Error
de: Fehler

# form.text.error
source: Please select a root site or a page that contains a site root and template!
de: Bitte wählen Sie eine Root-Site oder eine Seite, die eine Root-Site und eine Vorlage enthält!

# form.label.banner_enabled
source: Enable Prive script
de: Prive-Skript aktivieren

# form.label.banner_script
source: Prive script
de: Prive-Skript

# label.siteIdentifier
source: Site
de: Website

# label.siteRootPageId
source: Site Root Page ID
de: Wurzelseiten-ID
